'use client'

import styles from './ReanimFirstCorp.module.css'
import Image from 'next/image'
import React, { useState } from 'react'

export default function ReanimFirstCorp() {
  const [isPremedicalOpen, setIsPremedicalOpen] = useState(false)
  const [isBiliousOpen, setIsBiliousOpen] = useState(false)
  const [isHerniasOpen, setIsHerniasOpen] = useState(false)

  const [isCarpalSyndrome, setIsCarpalSyndrome] = useState(false)

  const toggleSection = (section) => {
    if (section === 'premedical') {
      setIsPremedicalOpen(!isPremedicalOpen)
    } else if (section === 'bilious') {
      setIsBiliousOpen(!isBiliousOpen)
    } else if (section === 'hernias') {
      setIsHerniasOpen(!isHerniasOpen)
    } else if (section === 'carpalSyndrome') {
      setIsCarpalSyndrome(!isCarpalSyndrome)
    }
  }

  return (
    <div className={styles.reanimFirstCorpContainer}>
      {/* <div className={styles.headerSection}>
      <h2 className={styles.firstSurgeryName}>Хірургічне відділення №1</h2>
    </div> */}

      {/* розділ печінки */}

      <div className={styles.reanimFirstCorpSection}>
        <h3 onClick={() => toggleSection('premedical')}>
          Домедична допомога <span>{isPremedicalOpen ? '▲' : '▼'}</span>
        </h3>
        {isPremedicalOpen && (
          <div className={styles.reanimFirstCorpTitle}>
            <div className={styles.reanimFirstCorpText}>
              <p>
                В житті вистачає непередбачуваних ситуацій, коли життя від
                смерті відділяють хвилини або секунди. І навіть якщо не брати до
                уваги військові дії, в мирному житті існує багато небезпек,
                пов’язаних з надзвичайними ситуаціями, дорожньо-транспортними
                пригодами, виробничими й побутовими травмами різної складності,
                електрикою або хімічними речовинами тощо.
              </p>

              <h2>Домедична допомога</h2>
              <p>
                {' '}
                невідкладні дії та організаційні заходи, спрямовані на
                врятування та збереження життя людини у невідкладному стані та
                мінімізацію наслідків впливу такого стану на її здоров’я, що
                здійснюються на місці події особами, які не мають медичної
                освіти.
              </p>

              <h2>Послідовність надання домедичної допомоги постраждалим</h2>

              <p>Надання домедичної допомоги заключається в наступному:</p>

              <ul>
                <li>
                  1. Скласти загальне враження про травмованого - інформація,
                  отримана під час наближення до постраждалого, на основі якої
                  формується попередній висновок про механізм та обставини
                  травми, попередній стан постраждалого.
                </li>
                <li>
                  {' '}
                  2. Провести первинний огляд - швидка оцінка важливих життєвих
                  функцій у постраждалого та за потреби усунення загрозливих для
                  життя станів.
                </li>
                <li>
                  {' '}
                  3. Виконати вторинний огляд - оцінка та визначення наявних
                  травм у постраждалого, що проводиться за умови відсутності
                  загрозливих для його життя станів.
                </li>
              </ul>

              <h4>Що для цього потрібно зробити:</h4>

              <p>
                Перед наданням допомоги переконатися у відсутності небезпеки для
                себе, оточуючих, постраждалого та тільки за її відсутності
                перейти до наступного кроку.
              </p>

              <h5>Первинне враження:</h5>

              <ul>
                <li>
                  під час наближення до постраждалого оцінити: вік, стать, вагу,
                  положення, в тому числі по відношенню до оточуючих предметів;
                </li>
                <li>звернути увагу на ознаки зовнішньої масивної кровотечі;</li>
                <li>
                  звернутися до постраждалого: «Ви мене чуєте? Мене звати
                  (назвати своє ім’я). Я можу вам допомогти?»;
                </li>
                <li>
                  наближатися до постраждалого зі сторони можливого візуального
                  контакту, щоб обмежити його рухи головою.
                </li>
              </ul>

              <p>
                У разі виявлення людини у невідкладному стані, яка не може
                особисто звернутися за наданням екстреної медичної допомоги та
                за відсутності медичних працівників на місці події громадянин
                України або будь-яка інша особа, які виявили таку людину,
                зобов’язані:
              </p>

              <h4>Наші кроки в такій ситуації.</h4>
              <ul>
                <li>негайно здійснити виклик екстреної медичної допомоги</li>

                <li>
                  або повідомити про виявлену людину у невідкладному стані та
                  про місце події працівників найближчого закладу охорони
                  здоров’я
                </li>
                <li>
                  чи будь-яку особу, яка зобов’язана надавати домедичну допомогу
                  та знаходиться поблизу місця події;
                </li>
              </ul>

              <h2>Порядок виклику екстреної (швидкої)медичної допомоги</h2>

              <p>
                <b>
                  Для виклику екстреної медичної допомоги треба зателефонувати
                  за номером 103{' '}
                </b>
                (єдиний телефонний номер виклику екстреної медичної допомоги)
                <b>або 112 </b>(єдиний телефонний номер виклику екстреної
                допомоги ). Виклик безоплатний.
              </p>
            </div>
            <div className={styles.reanimFirstCorpImage}>
              <img
                src="/images/reanimation/reanim8.JPG" // Шлях до зображення з папки public
                alt="Liver1"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/reanimation/reanim9.JPG" // Шлях до зображення з папки public
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/reanimation/reanim10.JPG" //
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/reanimation/reanim11.JPG" //
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/reanimation/reanim12.JPG" //
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ жовчевого міхура */}

      <div className={styles.reanimFirstCorpSection}>
        <h3 onClick={() => toggleSection('bilious')}>
          реанімація <span>{isBiliousOpen ? '▲' : '▼'}</span>
        </h3>
        {isBiliousOpen && (
          <div className={styles.reanimFirstCorpTitle}>
            <div className={styles.reanimFirstCorpText}>
              <p>
                Наявність конкрементів (в народі "каміння") в жовчевому міхурі
                довгий час нічим не проявляються. Це може бути "знахідка" при
                виконанні УЗД черевної порожнини з причини зовсім іншої.{' '}
              </p>
              <p>
                {' '}
                Прояв захворювання може з'являтися несподіванно у вигляді
                виражених болів в правому підребіррі - печінкова колька, яка
                виникає після зміщення конкрементів в шийку жовчевого міхура і
                закупорки виходу з нього.
              </p>

              <h4>Ознаки захворювання жовчевого міхура</h4>

              <h5>Прояви печінкової кольки</h5>

              <ul>
                <li>
                  Виражена біль в правому підребіррі з поширенням на ввесь живі,
                  а часом в праву лопатку і шию.{' '}
                </li>
              </ul>
              <p>
                Біль буває настільки виражена, що у хворого може раптово
                знизитися тиск і втрата сідомості.{' '}
              </p>

              <ul>
                <li>Нудота і блювота</li>
                <li>Згодом чоже бути підвищення температури тіла</li>
                <li>Може бути і поява жовтушності шкіри і слизових</li>
              </ul>

              <p>Хворого як правело доправляють в лікарню.</p>

              <p>
                {' '}
                Часом у хворого виникаю періодичні болі і дискомфорт в правому
                підребіррі. Хворі самостійно приймають ліки і досить довго не
                звертаються до лікаря. Більша частина з них знають що мають
                "каміня" в жовчевому міхурі. Хвороба приймає хронічний характер
              </p>

              <h4>Хронічний холецистит </h4>
              <p>
                При хронічному холециститі, крім названих вище симптомів, людина
                може відчувати біль у правому підребер'ї, що віддає в інші
                відділи живота, іноді навіть в серці, присмак гіркоти у роті,
                відрижку.
              </p>
              <p>
                Незалежно від того, як довго хворий "носить каміння в жовчевому
                міхурі" - Загострення хвороби і винекнення печінкової кольки
                може з'явитися будь коли і як правило в "самий непідходящий
                момент."
              </p>

              <h4>Як лікувати?</h4>

              <h5>Видалення жовчевого міхура</h5>
              <ul>
                <li>Лапароскопічна холецистектомія</li>
              </ul>

              <p>
                Золотим стандартом в лікуванні жовчнокам'яної хвороби сьогодні є
                лапароскопічне (малоінвазивне) видалення жовчевого міхура.
                Сучасна лапароскопічна операція значно зменшує страждання
                пацієнта в післяопераційному періоді за рахунок відсутності
                розрізів передньої черевної стінки, коли доступ до хворого
                органу (жовчевого міхура) виконується за допомогою постановки
                портів (0,5 - 10,0 мм),через які вводиться відіокамера та
                маніпулятори. Пацієнт через одну дві доби може бути виписаний на
                амбулаторне лікування. Операці дозволяє позбутися від хвороби
                назавжди.
              </p>

              <h4>
                Додаткові позитиви малоішвазивної лапараскопічної
                холецистектомії
              </h4>
              <ul>
                <li>
                  Гарна видимість для більш прицинзійної техніки операції{' '}
                </li>

                <li>Профілактика післяопераційних гриж</li>
                <li>Профілактика нагноєнь операційної рани</li>
                <li>Профілактика утворення злук і злукової хвороби</li>
              </ul>

              <h4>
                Ускладнення при довгому носінні конкрементів в жовчевому міхурі
              </h4>

              <ul>
                <li>
                  Водянка жовчевого міхура - це відключений жовчевий міхур з
                  прозорою рідиною
                </li>
                <li>
                  Емпієма жовчевого міхура - жовчевий міхур у вигляді "мішочка з
                  гнійним вмістом
                </li>
                <li>
                  Жовтянниця - пожовтіння шкіри та слизових як наслідок
                  закупорки протоків жовчевих протоків{' '}
                </li>
                <li> Холангіт - запаленнч жовчевивідних протоків</li>
                <li>Рак жовчевого міхура</li>
              </ul>

              <h4>Холангіт </h4>
              <p>
                Холангіт – гостре або хронічне запалення жовчовивідних протоків.
                Як внутрішньопечінкових, якими жовч збирається в жовчний міхур,
                так і позапечінкових, крізь які жовч надходить із міхура у
                дванадцятипалу кишку.
              </p>

              <h4>Найпоширеніші причини холангіту:</h4>

              <p>
                жовчнокам’яна хвороба, коли конкременти перекривають шлях
                відтоку жовчі, виникає холестаз, у протоках підвищується тиск та
                розвивається запалення а згодом підєднується мікробний фактор;
              </p>

              <h5>Діагностика холангіта</h5>
              <p>
                {' '}
                Захворюваггя, особливо в гострому періоді протікає виражено і
                хворий як правило звертається до лікаря.
              </p>

              <h5>Лікування холангіту</h5>
              <p>
                Усунення причини - механічної закупорки жовчевивідних щляхів,
                один із основних етапів лікування{' '}
              </p>

              <p>
                В нашій лікарні проводяться ендоскопічні операції (операції без
                розрізів), коли за допомогою спеціальних інстументів виконується
                механічне очищення жовчевивідних протоків. Далі приєднуються
                консервативні методи лікування у вигляді антибіотиків,
                протизапальних та спазмолітичних препаратів. Проводиться терапія
                по зняттю ітоксикації.{' '}
              </p>

              <h5>Реабілітація</h5>
              <p>
                {' '}
                Після усунення явищ холангіту, хворий передається для подальшого
                нагляду і лікуванню гастроентерологу.{' '}
              </p>
            </div>
            <div className={styles.reanimFirstCorpImage}>
              <img
                src="/images/chole/liver18ь.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={800}
                height={800}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liverм17.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/uzdcholм.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver19м.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/holetistectomlм.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver21м.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver22м.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/hfhslotomiм.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver20м.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ гриж */}

      <div className={styles.reanimFirstCorpSection}>
        <h3 onClick={() => toggleSection('hernias')}>
          знеболення<span>{isHerniasOpen ? '▲' : '▼'}</span>
        </h3>
        {isHerniasOpen && (
          <div className={styles.reanimFirstCorpTitle}>
            <div className={styles.reanimFirstCorpText}>
              <h4>Пахові, стегнові, пупкові та інші грижі черевної стінки:</h4>
              <ul>
                <li>
                  Лапароскопічна герніопластика із застосуванням сітчастого
                  імплантанта
                </li>
                <li>
                  Герніопластика місцевим доступом із застосуванням сітчастого
                  імплантанта
                </li>
                <li>Усунення діастазу прямих м’язів живота</li>
              </ul>
              <p>
                <strong>Герніопластика</strong> -{' '}
                <u>
                  це єдиний ефективний способом лікування грижі з застосуванням
                  оперативного втручання.
                </u>{' '}
                <br />
                Враховуючи вид грижі та стан пацієнта, лікар обирає оптимальний
                спосіб оперативного лікування гриж живота. Ми проводимо операції
                на сучасному обладнанні, з використанням новітніх технологій та
                високоякісних аллогенних матеріалів. Стінка черевної порожнини,
                де розміщуються черевні органи, утворені м'язево-апоневротичними
                шаром, який є досить щільний, однак має також і слабкі місця.
                Через розширення цих слабких місць (пупкове кільце, пахові
                ділянки та розтягнутої білої лінії живота), а також через старі
                післяопераційні рубці і випинаються внутрішні органи при
                підвищенні внутрішньочегового тиску. Якщо орган, (частіше всього
                це кишкивник чи чепець) який випинається через грижеві ворота
                защемиться, то тоді виникає дуже небезпечне для життя
                ускладнення - защемлена грижа. Це ускладнення може привести до
                смертельної для хворого ситуації. Єдиною допомогою хворому в цій
                ситуації є невідкладне оперативне лікування.
              </p>
              <p>
                <strong>Діастаз прямих мязів живота</strong> це розтягненнгя
                білої лінії живота, яке клінічно проявляється випинанням по
                серединній лінії живота вище пупка при напруженні черевного
                преса. Цей стан має декілька чинників які приводять до йогоу
                творення. І частіше, це поєднання їх. До таких чинників
                відносяться, це слабкість тканини самого апоневрозу та
                черезмірне, по часу, перенапруження черевного пресу. Ожиріння
                також сприяє розтягненню апоневрозу білої лінії живота.
                Клінічно, кроме появи випинання в ділянці білої лінії живота,
                часто буває біль. І практично цей стан є передвісником утворення
                гриж цієї ділянки і утворенню пупкових гриж.
              </p>
              <p>
                Єдиним методом лікуванню цього стану є оперативне. Методів
                оперативного лікування є декілька. Пацієнт звертається до
                хірурга і хірург визначає метод, який підходить для хворого
              </p>
              <h4>
                Грижі стравохідного отвору діафрагми (діафрагмальні грижі):
              </h4>
              <p>
                Ознаками гриж стравоходного отвору діафрагми є постіна печея. А
                також повернення їжі з шлунку при нагинанні хворого "симпртом
                шнурків" - хворий нагинається щоб зав'язати шнурки на ботінках і
                їжа, яку він з'їв раніше повертається в ротову порожнину.{' '}
              </p>
              <p>
                Виникнення такого недугу є порушенням закмикаючого миханізму в
                ділянці переходу стравоходу в шлунок. Причинами цього можуть
                бути різні стани, що приводять до підвишення внутрішньочеревного
                тиску і часто на фоні черевного ожиріння.
              </p>
              <p>
                {' '}
                Наслідками нелікованої хвороби може бути хронічне запалення
                нижньої частини стравоходу, що може привести до раку.
              </p>
              <p>
                {' '}
                В нашій клініці виконують оперативне лікування цього недугу і{' '}
                <b>золотим стандартом </b> на сьогодні є:
              </p>
              <ul>
                <li>
                  <strong>Лапароскопічна крурорафія з фундоплікацією</strong>
                </li>
              </ul>
              <p>
                Ця операція виконується малоінвазивним доступами, через проколи
                в черевні стінці.{' '}
              </p>
            </div>

            <div className={styles.reanimFirstCorpImage}>
              <img
                src="/images/gernio/fieleGernioи.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/gernio/gernіaи.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/gernio/gernioSurgeryи.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />{' '}
              <img
                src="/images/gernio/laparoscopyи.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/gernio/my abdominи.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>
      {/* розділ карпальний синдром */}
      <div className={styles.reanimFirstCorpSection}>
        <h3 onClick={() => toggleSection('carpalSyndrome')}>
          регіонарна анестезія<span>{isCarpalSyndrome ? '▲' : '▼'}</span>
        </h3>
        {isCarpalSyndrome && (
          <div className={styles.reanimFirstCorpTitle}>
            <div className={styles.reanimFirstCorpText}>
              <h2>Тунельний карпальний синдром</h2>
              <p>
                <br />
                попри його багато назв ({' '}
                <em>
                  cиндро́м зап'я́стного кана́лу, “синдром друкарки”, хвороба
                  офісних працівників…
                </em>
                )є там захворюванням яке виникає в людей, чия професія пов'язана
                з одноманітними рухами зап'ястя та незручним положенням рук при
                виконанні роботи
              </p>
              <p className={styles.indentedText}>
                Суть захворювання зводиться до того,що в процесі цих рухів кисті
                поступово виникає{' '}
                <u>потовщення і ушільненя оболонок сухожилків згиначів,</u> які
                проходять з передпліччя на кисть через вузький кнал на запястку.
                Цей канал називається карпальним, є досить обмежений і в зв'язку
                з тим що він утворений з трьох сторін кістками зап'ястка. А з
                однієї сторони досить щільною карпальною з'язкою, яка невзмозі
                розтягуватися. Тому місця в цьому каналі досить обмежено і через
                ці потовшення оболонок сухожилок приводить{' '}
                <u>до стискання нера (серединного) </u>який також там проходить.
              </p>
              <h4>Серединний нерв дозволяє:</h4> <br />
              <ul>
                <li> відчувати перші чотири пальці, </li>
                <li>
                  відповідає за координацію руху кисті, дрібну моторику рук,
                </li>
                <li>
                  звуження і розширення кровоносних судин від дії зовнішніх
                  подразників
                </li>
                <li>регулює роботу потових залоз долоні</li>
              </ul>
              <div className={styles.developList}>
                <h4>Все починається з </h4>
                <p>
                  Першою зазвичай захворює провідна рука (рука яка більше бере
                  на себе навантаження )
                </p>
                <ul>
                  <li>
                    прогресуючого оніміння і болю у руках, особливо вночі;
                  </li>
                  <li>виникає набряклость, нечутливості пальців вранці;</li>
                </ul>
                <h4>Прогресування</h4>
                <p>
                  Якщо захворювання не ліковане то згодом до них додаються такі
                  сиптоми як:
                </p>
                <ul>
                  <li>порушення рухів долонь, слабкість рук;</li>
                  <li>нездатність брати та утримувати дрібні предмети.</li>
                </ul>
                <h4>В фінальні стадії зхворювання</h4>
                <p>
                  Якщо довго не лікувати затискання нерва, це може призвести до
                  незворотнього пошкодження нерва та радикально погіршити якість
                  життя
                </p>
                <ul>
                  <li>
                    порушення чутливості пальців стають дедалі більше вираженими
                  </li>
                  <li>з часом зношуються м’язи долоні</li>
                  <li>
                    долоня втрачає свою силу і зникає здатність виконувати
                    навіть прості повсякденні дії.
                  </li>
                </ul>
                <p>
                  Наведена вище картина приводить до того, що хворий звертається
                  до лікаря.
                </p>
              </div>
              <h2 className={styles.conservTitle}>
                Консервативне лікування синдрому карпального каналу
              </h2>
              <h4>Консервативне лікування в невропатолога</h4>
              <p>
                Застосування консервативної терапії чаще є початковим методом
                лікування. Як правело хворий спочатку захворювання потрапляє до
                невропатолога, який починає лікування з неї.Консервативне
                лікування синдрому зап'ястного каналу спрямоване на те, щоб
                зменшити травматизацію серединного нерва в каналі (зменшення
                набряку оболонок сухожилок і зв'язок) , а також покращення
                обмінних процесів в самому нерві.
              </p>
              <h2>Напрямки консервативного лікування</h2>
              <ul>
                <li>
                  Це зміна (при можливості ) професії та модифікація способу
                  життя, дотримання режиму праці та відпочинку
                </li>
                <li>
                  Це носіння ортеза що понукає положення зап'ястка в
                  фізіологічному положенні і тим самим сприяє зменшеню тиску на
                  серединний нерв
                </li>
                <li>
                  Загальна лікарська терапія (НПЗП, засоби для поліпшення
                  кровообігу, зняття набряклості ); і фізіотерапія (масаж,
                  електрофорез); також дещо покращує стан хворого
                </li>
                <li>
                  Лікарські блокади щляхом введення анестетиків і
                  кортикостероїдів (кеналог, дипроспан) в зону тунелю для
                  купування болю і відновлення рухливості суглобів дає яскравий
                  і виражений, але нетривалий ефект
                </li>
              </ul>
              <h4>
                При неефективності консервативного лікування потрібне оперативне
                лікувавння
              </h4>
              <h2>Операція - найефективний спосіб</h2>
              <p>
                Це найбільш ефективний та останній спосіб лікування синдрому
                карпального каналу. Оскільки сутністю цієї хвороби є затискання
                нерва, мета операції – це звільнення нерва від затиснутого
                стану, що досягається шляхом перерізання карпальної зв’язки.
                Операція виконується в сучасні операційні з моніторним наглядом
                за станом пацієнта. триває недовго і легко переноситься., її
                роблять під місцевим (локальним) наркозом – як у стоматолога.
                Незабаром після операції пацієнт може вирушати додому.
              </p>
              <h4>Знебллення - місцеве.</h4>
              <p>
                В ділянку операції вводиться місцевий анастетик (після
                відповідних проб). При необхідності спосіб знеболення може
                коригуватися анастезіологом
              </p>
              <h4>Методи оперативного лікування</h4>
              <p>
                {' '}
                Для звільнення нерва застосовується або традиційний хірургічний
                метод, або більш новий і значно менш травматичний ендоскопічний
                метод.
              </p>
              <h5>Традиційний метод</h5>
              <p>
                В ділянці запястка, по нижній складці робиться косий розріз 1,5
                - 2,0 см через який знаходится карпальна з'язка і розсікається в
                поперечному до неї напрямку. Після контролю зупинки кровотечі
                шви накладаються тільки на шкіру. Через деякий час розрізу
                практично невидно
              </p>
              <h5>Ендоскопічний метод</h5>
              <p>
                Ендоскопічний метод є набагато щаднішим для пацієнта. Через
                маленький розріз в шкірі в карпальний канал вводиться
                мініатюрний ендоскоп (медична відеокамера) і з застосуванням
                маленьких хірургічних інструментів перерізається карпальна
                зв’язка, звільняючи таким чином нерв.
              </p>
            </div>
            <div className={styles.reanimFirstCorpImage}>
              <img
                src="/images/CarpalSyndrome/carp39и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp56и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp25и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp18и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp15и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp58и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp52и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp16и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp10и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp7и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp41и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp42и.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>
    </div>
  )
}
