'use client'

import styles from './FirstSurgery.module.css'
import Image from 'next/image'
import React, { useState } from 'react'

export default function FirstSurgery() {
  const [isLiverOpen, setIsLiverOpen] = useState(false)
  const [isBiliousOpen, setIsBiliousOpen] = useState(false)
  const [isHerniasOpen, setIsHerniasOpen] = useState(false)
  const [isDpkOpen, setIsDpkOpen] = useState(false)
  const [isSpleenOpen, setIsSpleenOpen] = useState(false)
  const [isIntestineOpen, setIsIntestineOpen] = useState(false)

  const [isTumorsOpen, setIsTumorsOpen] = useState(false)
  const [isUrgent, setIsUrgent] = useState(false)

  const [isAbdominoplasty, setIsAbdominoplasty] = useState(false)
  const [isAugmentation, setIsAugmentation] = useState(false)
  const [isRemovalImplants, setIsRemovalImplants] = useState(false)
  const [isGynecomastia, setIsGynecomastia] = useState(false)
  const [isLiposuction, setIsLiposuction] = useState(false)
  const [isCarpalSyndrome, setIsCarpalSyndrome] = useState(false)

  const toggleSection = (section) => {
    if (section === 'liver') {
      setIsLiverOpen(!isLiverOpen)
    } else if (section === 'bilious') {
      setIsBiliousOpen(!isBiliousOpen)
    } else if (section === 'hernias') {
      setIsHerniasOpen(!isHerniasOpen)
    } else if (section === 'dpk') {
      setIsDpkOpen(!isDpkOpen)
    } else if (section === 'spleen') {
      setIsSpleenOpen(!isSpleenOpen)
    } else if (section === 'intestine') {
      setIsIntestineOpen(!isIntestineOpen)
    } else if (section === 'tumors') {
      setIsTumorsOpen(!isTumorsOpen)
    } else if (section === 'urgent') {
      setIsUrgent(!isUrgent)
    } else if (section === 'abdominoplasty') {
      setIsAbdominoplasty(!isAbdominoplasty)
    } else if (section === 'augmentation') {
      setIsAugmentation(!isAugmentation)
    } else if (section === 'removalImplants') {
      setIsRemovalImplants(!isRemovalImplants)
    } else if (section === 'gynecomastia') {
      setIsGynecomastia(!isGynecomastia)
    } else if (section === 'liposuction') {
      setIsLiposuction(!isLiposuction)
    } else if (section === 'carpalSyndrome') {
      setIsCarpalSyndrome(!isCarpalSyndrome)
    }
  }

  return (
    <div className={styles.firstSurgeryContainer}>
      {/* <div className={styles.headerSection}>
        <h2 className={styles.firstSurgeryName}>Хірургічне відділення №1</h2>
      </div> */}

      {/* розділ печінки */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('liver')}>
          Хвороби печінки <span>{isLiverOpen ? '▲' : '▼'}</span>
        </h3>
        {isLiverOpen && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <p>
                Кіста на печінці — доброякісна пухлина у вигляді капсули,
                наповненої прозорою або жовтуватою рідиною.{' '}
              </p>

              <h4>Види кіст печінки</h4>
              <ul>
                <li>
                  Істинними — вроджені, формуються через патологічні зміни
                  жовчних проток під час внутрішньоутробного розвитку. До них
                  відносяться кістофіброз, полікістоз і солітарні кісти. Їхня
                  внутрішня поверхня складається з клітин епітелію.
                </li>
                <li>
                  Хибними — з’являються в результаті травм, різних запальних
                  захворювань, внутрішня поверхня вистелена фіброзними
                  тканинами.
                </li>
                <li>
                  Паразитарними — виникають у результаті протозойного
                  інфікування або глистової інвазії. Бувають ехінококовими та
                  альвеококовими.
                </li>
                <li>
                  Непаразитарними — виникають з безлічі різних причин, включаючи
                  травми і прийом гормональних препаратів, в більшості випадків
                  виявляються випадково.
                </li>
              </ul>

              <h4>Симптоми, які свідчать про наявність кісти печінки</h4>

              <p>
                Симптоми наявності кисти печінки досить загальні і різноманітні.
                Настороження про захворювання печінки може викликати такий
                симптом як жовтушність.{' '}
              </p>

              <p>
                {' '}
                При появи любих даже незначних ознаків погіршення самопочуття,
                яке наможа пояснити, слід звернутися до ЛІКАРЯ. Як правело при
                звернення до лікаря хворому призначається УЗД. Киста дость гарно
                видно при цьому дослідженні. Далі сперціаліст дообстежує
                пацієнта. КТ. МРТ. і вирішується подальша тактика лікування.
              </p>

              <h4>Які ускладнення дає кіста в печінці</h4>

              <p>
                Субкапсулярні кісти невеликого розміру не становлять небезпеки
                для здоров’я і не викликають дискомфорту, проте зі збільшенням
                їхнього розміру ризик неприємних наслідків зростає в рази. Серед
                можливих ускладнень:
              </p>

              <ul>
                <li>
                  холецистит, що супроводжується зниженням працездатності,
                  слабкістю, задишкою, сонливістю і втратою апетиту;
                </li>
                <li>
                  здавлювання шлунка і кишечника та, як наслідок, порушення
                  травлення, ниркові і печінкові кольки;
                </li>
                <li>запалення жовчовивідних шляхів і механічна жовтяниця;</li>
                <li>
                  запалення і нагноєння кісти з її подальшим розривом
                  (перитоніт);
                </li>
                <li>внутрішні кровотечі та крововиливи в стінку печінки;</li>
                <li>перекрут новоутворення;</li>
                <li>переродження в злоякісну пухлину;</li>
                <li>
                  зараження організму гельмінтами при розриві паразитарної кісти
                  і поширенні паразитів у сусідні органи;
                </li>
                <li>летальний результат.</li>
              </ul>

              <h4>
                Розпізнати розвиток ускладнень можна за такими симптомами:
              </h4>

              <ul>
                <li>гострий біль у правому підребер’ї;</li>
                <li>
                  підвищення температури тіла, що супроводжується слабкістю та
                  ознобом;
                </li>
                <li>порушення сну та апетиту;</li>
                <li>забарвлення сечі в темний колір;</li>
                <li>пожовтіння шкіри й очних склер;</li>
                <li>блювота і нудота;</li>
                <li>значне збільшення печінки.</li>
              </ul>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/liver/liver.jpg" // Шлях до зображення з папки public
                alt="Liver1"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/liver/liver2.jpg" // Шлях до зображення з папки public
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/liver/liver.jpg" //
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/liver/liver3.jpg" // Шлях до зображення з папки public
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/liver/liver4.jpg" // Шлях до зображення з папки public
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/liver/liver7.jpg" // Шлях до зображення з папки public
                alt="Liver2"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ жовчевого міхура */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('bilious')}>
          Хвороби жовчевого міхура та жовчевивідних шляхів{' '}
          <span>{isBiliousOpen ? '▲' : '▼'}</span>
        </h3>
        {isBiliousOpen && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <p>
                Наявність конкрементів (в народі "каміння") в жовчевому міхурі
                довгий час нічим не проявляються. Це може бути "знахідка" при
                виконанні УЗД черевної порожнини з причини зовсім іншої.{' '}
              </p>
              <p>
                {' '}
                Прояв захворювання може з'являтися несподіванно у вигляді
                виражених болів в правому підребіррі - печінкова колька, яка
                виникає після зміщення конкрементів в шийку жовчевого міхура і
                закупорки виходу з нього.
              </p>

              <h4>Ознаки захворювання жовчевого міхура</h4>

              <h5>Прояви печінкової кольки</h5>

              <ul>
                <li>
                  Виражена біль в правому підребіррі з поширенням на ввесь живі,
                  а часом в праву лопатку і шию.{' '}
                </li>
              </ul>
              <p>
                Біль буває настільки виражена, що у хворого може раптово
                знизитися тиск і втрата сідомості.{' '}
              </p>

              <ul>
                <li>Нудота і блювота</li>
                <li>Згодом чоже бути підвищення температури тіла</li>
                <li>Може бути і поява жовтушності шкіри і слизових</li>
              </ul>

              <p>Хворого як правело доправляють в лікарню.</p>

              <p>
                {' '}
                Часом у хворого виникаю періодичні болі і дискомфорт в правому
                підребіррі. Хворі самостійно приймають ліки і досить довго не
                звертаються до лікаря. Більша частина з них знають що мають
                "каміня" в жовчевому міхурі. Хвороба приймає хронічний характер
              </p>

              <h4>Хронічний холецистит </h4>
              <p>
                При хронічному холециститі, крім названих вище симптомів, людина
                може відчувати біль у правому підребер'ї, що віддає в інші
                відділи живота, іноді навіть в серці, присмак гіркоти у роті,
                відрижку.
              </p>
              <p>
                Незалежно від того, як довго хворий "носить каміння в жовчевому
                міхурі" - Загострення хвороби і винекнення печінкової кольки
                може з'явитися будь коли і як правило в "самий непідходящий
                момент."
              </p>

              <h4>Як лікувати?</h4>

              <h5>Видалення жовчевого міхура</h5>
              <ul>
                <li>Лапароскопічна холецистектомія</li>
              </ul>

              <p>
                Золотим стандартом в лікуванні жовчнокам'яної хвороби сьогодні є
                лапароскопічне (малоінвазивне) видалення жовчевого міхура.
                Сучасна лапароскопічна операція значно зменшує страждання
                пацієнта в післяопераційному періоді за рахунок відсутності
                розрізів передньої черевної стінки, коли доступ до хворого
                органу (жовчевого міхура) виконується за допомогою постановки
                портів (0,5 - 10,0 мм),через які вводиться відіокамера та
                маніпулятори. Пацієнт через одну дві доби може бути виписаний на
                амбулаторне лікування. Операці дозволяє позбутися від хвороби
                назавжди.
              </p>

              <h4>
                Додаткові позитиви малоішвазивної лапараскопічної
                холецистектомії
              </h4>
              <ul>
                <li>
                  Гарна видимість для більш прицинзійної техніки операції{' '}
                </li>

                <li>Профілактика післяопераційних гриж</li>
                <li>Профілактика нагноєнь операційної рани</li>
                <li>Профілактика утворення злук і злукової хвороби</li>
              </ul>

              <h4>
                Ускладнення при довгому носінні конкрементів в жовчевому міхурі
              </h4>

              <ul>
                <li>
                  Водянка жовчевого міхура - це відключений жовчевий міхур з
                  прозорою рідиною
                </li>
                <li>
                  Емпієма жовчевого міхура - жовчевий міхур у вигляді "мішочка з
                  гнійним вмістом
                </li>
                <li>
                  Жовтянниця - пожовтіння шкіри та слизових як наслідок
                  закупорки протоків жовчевих протоків{' '}
                </li>
                <li> Холангіт - запаленнч жовчевивідних протоків</li>
                <li>Рак жовчевого міхура</li>
              </ul>

              <h4>Холангіт </h4>
              <p>
                Холангіт – гостре або хронічне запалення жовчовивідних протоків.
                Як внутрішньопечінкових, якими жовч збирається в жовчний міхур,
                так і позапечінкових, крізь які жовч надходить із міхура у
                дванадцятипалу кишку.
              </p>

              <h4>Найпоширеніші причини холангіту:</h4>

              <p>
                жовчнокам’яна хвороба, коли конкременти перекривають шлях
                відтоку жовчі, виникає холестаз, у протоках підвищується тиск та
                розвивається запалення а згодом підєднується мікробний фактор;
              </p>

              <h5>Діагностика холангіта</h5>
              <p>
                {' '}
                Захворюваггя, особливо в гострому періоді протікає виражено і
                хворий як правило звертається до лікаря.
              </p>

              <h5>Лікування холангіту</h5>
              <p>
                Усунення причини - механічної закупорки жовчевивідних щляхів,
                один із основних етапів лікування{' '}
              </p>

              <p>
                В нашій лікарні проводяться ендоскопічні операції (операції без
                розрізів), коли за допомогою спеціальних інстументів виконується
                механічне очищення жовчевивідних протоків. Далі приєднуються
                консервативні методи лікування у вигляді антибіотиків,
                протизапальних та спазмолітичних препаратів. Проводиться терапія
                по зняттю ітоксикації.{' '}
              </p>

              <h5>Реабілітація</h5>
              <p>
                {' '}
                Після усунення явищ холангіту, хворий передається для подальшого
                нагляду і лікуванню гастроентерологу.{' '}
              </p>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/chole/liver18.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={800}
                height={800}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver17.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/uzdchol.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver19.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/holetistectoml.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver21.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver22.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/hfhslotomi.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/chole/liver20.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ гриж */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('hernias')}>
          Грижі<span>{isHerniasOpen ? '▲' : '▼'}</span>
        </h3>
        {isHerniasOpen && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h4>Пахові, стегнові, пупкові та інші грижі черевної стінки:</h4>
              <ul>
                <li>
                  Лапароскопічна герніопластика із застосуванням сітчастого
                  імплантанта
                </li>
                <li>
                  Герніопластика місцевим доступом із застосуванням сітчастого
                  імплантанта
                </li>
                <li>Усунення діастазу прямих м’язів живота</li>
              </ul>
              <p>
                <strong>Герніопластика</strong> -{' '}
                <u>
                  це єдиний ефективний способом лікування грижі з застосуванням
                  оперативного втручання.
                </u>{' '}
                <br />
                Враховуючи вид грижі та стан пацієнта, лікар обирає оптимальний
                спосіб оперативного лікування гриж живота. Ми проводимо операції
                на сучасному обладнанні, з використанням новітніх технологій та
                високоякісних аллогенних матеріалів. Стінка черевної порожнини,
                де розміщуються черевні органи, утворені м'язево-апоневротичними
                шаром, який є досить щільний, однак має також і слабкі місця.
                Через розширення цих слабких місць (пупкове кільце, пахові
                ділянки та розтягнутої білої лінії живота), а також через старі
                післяопераційні рубці і випинаються внутрішні органи при
                підвищенні внутрішньочегового тиску. Якщо орган, (частіше всього
                це кишкивник чи чепець) який випинається через грижеві ворота
                защемиться, то тоді виникає дуже небезпечне для життя
                ускладнення - защемлена грижа. Це ускладнення може привести до
                смертельної для хворого ситуації. Єдиною допомогою хворому в цій
                ситуації є невідкладне оперативне лікування.
              </p>
              <p>
                <strong>Діастаз прямих мязів живота</strong> це розтягненнгя
                білої лінії живота, яке клінічно проявляється випинанням по
                серединній лінії живота вище пупка при напруженні черевного
                преса. Цей стан має декілька чинників які приводять до йогоу
                творення. І частіше, це поєднання їх. До таких чинників
                відносяться, це слабкість тканини самого апоневрозу та
                черезмірне, по часу, перенапруження черевного пресу. Ожиріння
                також сприяє розтягненню апоневрозу білої лінії живота.
                Клінічно, кроме появи випинання в ділянці білої лінії живота,
                часто буває біль. І практично цей стан є передвісником утворення
                гриж цієї ділянки і утворенню пупкових гриж.
              </p>
              <p>
                Єдиним методом лікуванню цього стану є оперативне. Методів
                оперативного лікування є декілька. Пацієнт звертається до
                хірурга і хірург визначає метод, який підходить для хворого
              </p>
              <h4>
                Грижі стравохідного отвору діафрагми (діафрагмальні грижі):
              </h4>
              <p>
                Ознаками гриж стравоходного отвору діафрагми є постіна печея. А
                також повернення їжі з шлунку при нагинанні хворого "симпртом
                шнурків" - хворий нагинається щоб зав'язати шнурки на ботінках і
                їжа, яку він з'їв раніше повертається в ротову порожнину.{' '}
              </p>
              <p>
                Виникнення такого недугу є порушенням закмикаючого миханізму в
                ділянці переходу стравоходу в шлунок. Причинами цього можуть
                бути різні стани, що приводять до підвишення внутрішньочеревного
                тиску і часто на фоні черевного ожиріння.
              </p>
              <p>
                {' '}
                Наслідками нелікованої хвороби може бути хронічне запалення
                нижньої частини стравоходу, що може привести до раку.
              </p>
              <p>
                {' '}
                В нашій клініці виконують оперативне лікування цього недугу і{' '}
                <b>золотим стандартом </b> на сьогодні є:
              </p>
              <ul>
                <li>
                  <strong>Лапароскопічна крурорафія з фундоплікацією</strong>
                </li>
              </ul>
              <p>
                Ця операція виконується малоінвазивним доступами, через проколи
                в черевні стінці.{' '}
              </p>
            </div>

            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/gernio/fieleGernio.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/gernio/gernіa.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/gernio/gernioSurgery.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />{' '}
              <img
                src="/images/gernio/laparoscopy.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/gernio/my abdomin.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ ДПК */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('dpk')}>
          Хвороби шлунка і дванадцятипалої кишки{' '}
          <span>{isDpkOpen ? '▲' : '▼'}</span>
        </h3>
        {isDpkOpen && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <p>
                Виразка шлунка і ДПК в неускладненній її формі є недугом
                терапевтичним і при дотриманні всіх лікарських рекомендацій як
                правело приводить до виздоровлення з заживленням виразкового
                дефекту. Але ускладненнями виразкової хвороби шлука і ДПК, уже
                займаються хірурги. Тому щоб не допустити до ускладнень, хворий
                має добре усвідомлювати що при будть яких болів в животі
                потрібно звернутися до лікаря
              </p>
              <h4>Симптоми виразки шлунка і ДПК</h4>
              <ul>
                <li>
                  Больовий синдром. Відчуття болю локалізуються в верхні ділянці
                  живота і можливо більше справа.{' '}
                </li>
                <li>Можливі прояви нудоти, печії. Рідко – блювота.</li>
                <li>
                  Інтоксикаційний синдром: - слабкість, швидка стомлюваність,
                  сонливість, іноді підвищується температура 37, ... 38.
                </li>
                <li>
                  Порушення травлення. Спостерігаються при поєднанні з ентеритом
                  і колітом. На перший план виступають запор або проноси, слабкі
                  постійні болі по всьому животі, здуття.
                </li>
                <li>бурчання і здуття живота;</li>
              </ul>
              <p>
                Бувають випадки коли перечисленні симптоми настільки слабо
                виражені що хворий їх практично не помічає і першим зверненням
                до лікаря є вже через її ускладнення.
              </p>

              <p>
                Лікування неускладнених форм виразкової хвороби займаються
                терапевт-гастоентеролог (протокольно). При своєчасному зверненні
                хвороба консервативно лікується досить успішно
              </p>

              <p>Діагноз виставляється на основі ФГДС</p>

              <h4>Ускладнення виразкової хвороби шлунку і ДПК</h4>

              <h5>Кровотеча з втразки шлунка чи ДПК</h5>
              <p>
                Блювота кавовою гущею і виділення чорного стільця "мелена",
                виражена слабкість{' '}
              </p>

              <h5>Проривна виразка шлунка чи ДПК</h5>
              <p>
                Різкі болі в верхній частині та в правій половині живота серед
                "повного здоров'я". Хворого доставляє в лікарню карета швидкої
                допомоги і проводяться діагностично-лікувальні заходи{' '}
              </p>

              <h5>Рубцева деформація з стенозом ДПК</h5>
              <p>
                Хворий, який довго хворіє виразковою хворобою і як правело до
                свого лікування відносився не досить сумлінно починає помічати,
                що після їжі відчува слідуючі симптоми
              </p>
              <ul>
                <li>Відчуття сильної важкості в верхній частині живота </li>
                <li>
                  часті відрижки спочатку зїденою їжею а подальше і кислим
                  повітрям з бродільни запахом
                </li>
                <li>
                  згодом приєднуються блювота їжею з бродільним процесами, або
                  хворий викликає блювоту сам, тому що вона йому приносить
                  полегшення.
                </li>
                <li>Хворий починає худнути.</li>
              </ul>
              <p>
                <b>
                  Хвоий повинен звернутися до лікаря і лікар допоможе вияснити
                  причину такого стану.
                </b>
              </p>

              <h5> Пенетрація</h5>

              <p>
                <u>
                  Виникає після тривалого захворювання. Коли виразка прогризає
                  стінки шлунка чи кишки і дно виразки переходить на той орган,
                  який прилягає до ураженої частини шлунка чи ДПК .
                </u>{' '}
                Якщо пенетрація пошкоджує підщлункову залозу то може виникнути
                панкреатит.
              </p>

              <p>
                {' '}
                Обстеження у нашій лікарні допоможе прояснити картину недугу.
              </p>
              <p>
                <mark>
                  <strong>
                    В нашій клініці проводяться всі діагностичі маніпуляції та
                    лікування таких хворих на високому рівні і про це свідчать
                    результи та відгуки пролікованих пацієнтів.
                  </strong>
                </mark>
              </p>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/dpk/dpk.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/dpk/pecheya2.jpg"
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/dpk/gastro.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/dpk/dpkUlcer2.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/dpk/gemoDpk2.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/dpk/duodenUlceri.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ селезінки */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('spleen')}>
          Хвороби селезінки <span>{isSpleenOpen ? '▲' : '▼'}</span>
        </h3>
        {isSpleenOpen && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h4>Видалення селезінки - Спленектомія</h4>
              <ul>
                <li>Лапароскопічна спленектомія</li>
                <li>Традиційна спленектомія</li>
              </ul>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ кишкивника */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('intestine')}>
          Хвороби кишкивника <span>{isIntestineOpen ? '▲' : '▼'}</span>
        </h3>
        {isIntestineOpen && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h4>Лікування захворювань товстого кишкивника.</h4>
              <ul>
                <li>Консервативне лікування дивертикульоза</li>
                <li>Хірургічне лікування ускладнень</li>
                <li>
                  Лапароскопічні та традиційні втручання при патології товстого
                  кишківника
                </li>
                <li>
                  Реконструктивні втручання при патології товстого кишківника
                  (колостома)
                </li>
              </ul>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ пухлин */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('tumors')}>
          Доброякісні пухлини м'ягких тканей тулуба та кінцівок.{' '}
          <span>{isTumorsOpen ? '▲' : '▼'}</span>
        </h3>
        {isTumorsOpen && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h4>Доброякісні новоутворення шкіри і підшкірної клітковини</h4>
              <p>
                Вони не загрожують життю людини. Але іноді, під впливом
                негативних факторів вони можуть траснформуватися в злоякісні
                пухлини.
              </p>

              <h5>Характтерні особливості доброякісних новоутворень: </h5>
              <ul>
                <li>новоутворення не проростає в сусідні тканини</li>
                <li>клітинні елементи не поширюються за межі пухлини</li>
                <li>формуються по принципу капсули</li>
                <li>повільно зростає</li>
                <li>збільшується рівномірно</li>
              </ul>

              <h5>НЕВУС</h5>
              <p>
                новоутворення доброякісного характеру, що виникає на шкірі у
                вигляді пігментації.
                <br /> Рекомендовано видаляти їх, якщо вони локалізовані у
                незручних місцях на тілі, або у разі загрози переродження у
                злоякісне новоутворення.
              </p>

              <h5>ПАПІЛОМА</h5>
              <p>
                Доброякісне пухлиноподібне новоутворення на шкірі або на
                слизовій оболонці.
                <br />
                Основна причина виникнення цих пухлин – вірус папіломи.
              </p>

              <h5>АТЕРОМА </h5>
              <p>
                Eпітеліальна кіста – це доброякісне новоутворення сальної
                залози, яке виникає в результаті її закупорки.
              </p>

              <h5>ГЕМАНГІОМА</h5>
              <p>
                оброякісні судинні утворення, які можуть бути наслідком
                порушення розвитку судин в ембріональний період.{' '}
              </p>

              <h5>ЛІПОМА</h5>
              <p>
                Доброякісна жирова пухлина. Це новоутворення, яке формується з
                жирового прошарку, тому його друга назва – «жировик».
              </p>

              <h5>ФІБРОМА</h5>
              <p>
                {' '}
                доброякісна пухлина з волокнистої сполучної тканини.
                <br />
                Часто поєднується з розростанням інших тканин – зокрема м’язової
                (фіброміома), судинної (ангіофіброма), залізистої
                (фіброаденома). Дуже часто її діагностують у молодому віці,
                переважно у жіночої статі. Вона може бути різного кольору : від
                сірого до чорного. Поверхня зазвичай гладка, зростає повільно.
              </p>

              <h4>
                HАСТОРОЖЕННЯ які показують що потрібно негайно звернутися до
                лікаря, якщо новоутворення:
              </h4>

              <ul>
                <li>збільшуються;</li>
                <li>почали випадати волоски з її поверхні;</li>
                <li>змінюють колір, кровоточать, змінюють консистенцію</li>
                <li>зменшуються, змінюють форму, його контур став розмитим;</li>
                <li>
                  приєдналося запалення, свербіж, на його поверхні утворилися
                  тріщини.
                </li>
              </ul>

              <h4>ПРОФІЛАКТИЧНІ ЗАХОДИ</h4>
              <ul>
                <li>Уникайте перебування на сонці</li>
                <li>Своєчасно звертайтеся до лікаря</li>
                <li>
                  Проходьте регулярну діагностику за допомогою ДЕРМАТОСКОПА
                </li>
              </ul>

              <h4>Цифрова дерматоскопія</h4>

              <p>
                <u>
                  Цифрова дерматоскопія – дозволяє розглядати утворення шкіри
                  під значним збільшенням,{' '}
                </u>
                таким чином, що стають видно пігментація і будова епідермісу,
                межа дерми і епідермісу, сосочковий шар і виводить зображення на
                монітор комп'ютера, що дає можливість уточнити діагноз
              </p>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/derma/dpkUlcer.jpg"
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/derma/papiloma.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/derma/teroma.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/derma/gemangioma.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/derma/lipoma.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/derma/fibroma.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/derma/dermatoskop.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>
      <div>
        <h2 className={styles.firstSurgeryName}>Невідкладна хірургія</h2>
      </div>

      {/* розділ невідкладна хірургія */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('urgent')}>
          Невідкладна хірургія <span>{isUrgent ? '▲' : '▼'}</span>
        </h3>
        {isUrgent && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h4>Ургентні стани</h4>
              <p>
                {' '}
                <u>
                  Це стани які можуть виникати практично на фоні "повного
                  здоров'я" і якщо щвидко не звернутися до лікаря, який надасть
                  допомогу,
                </u>
                <b>можуть привести до смерті пацієнта</b>
              </p>
              <h5>Гострий апендицит</h5>
              <p>
                Біль в правій ділянці живота ближче до паха. Може починатися в
                ділянці шлунка з нудотою чи блювотою, але через деякий час
                преходить в низ живота справа. Біль не проходить самостійно і
                можна її вважати спочатку постійною, хоча згодом інтенсивність
                може зменшитися, що не є показником для заспокоєння. Хвороба
                перейшла в слідуючу стадію і до дуже опасних ускладнень
                (перитоніт) стало набагато ближче.{' '}
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>
              <h5>Гострий холецистит</h5>
              <p>
                Біль в правому підребіррі. Може бути досить нестерпні у вигляді
                коліки - "печінкова колька." Виникає чаще всього після порушені
                в харчувані (жирна і жарена їжа). Практично постійно біль
                супроводжується нудотою і блювотою. Біль може мати
                приступоподібний характер.
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>
              <h5>Гострий панкреатит</h5>
              <p>
                Біль в верхній частині живота "оперізуючого" характера. Може
                бути досить нестерпні по типу "забитого килка". Виникає чаще
                всього після порушені в харчувані (жирна і жарена їжа) і прийому
                алкоголя. Практично постійно біль супроводжується нудотою і
                блювотою, яка може мати харектер "невгамонної", тобто блювота
                яка не припиняється даже якщо порожній шлунок і "блювати вже
                нема чим".
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>
              <h5>Перитоніт</h5>
              <p>
                Біль по всьому животу. Живіт стає напружений і часто "як доска".
                Хворий не може дихнути за "рахунок живота". Постійно є нудота і
                блювота. Як правело такий стан виникає як продовження правктично
                всіх невідкладних стані пов'язаний з органами черевної
                порожнини. Це практично слідуюча дость стадія перебігу їх
                захворювання. Ризик для життя дуже значно підвищується даже при
                умові лікування.
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>
              <h5>Гостра шлунково-кишкова кровотеча</h5>
              <p>
                Клінічна картина шлунково-кишкової-кровотечі, які б захворювання
                не привели до неї , мають практично одинакові симптоми і
                одинаковий перебіг. Несподівано виникає слабкість та порушення
                зору - потемніння та "бігання мурашок перед очима". Виникає
                блювота у вигляді "кавової гущі". Згодом виникає понос "мелена",
                абсолютно чорного кольору з дуже "специфічним дурним запахом".
                Кровотеча завжди, якщо її не зупинити, приводить до смертельного
                фінішу.
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>
              <h5>Защемлені грижі</h5>
              <p>
                Грижеве випинання, про яке хворий знає що в нього воно є,
                перстало вправлятися і почало дуже боліти. Біль чаще досить
                сильна. Цей стан може супроводжуватися нудотою і блювото. Дуже
                важливо щоб хворий чим скоріше звернувся за медичною допомогою.
                Зашемлюватися може любий орган з черевної порожнини. Частіше це
                чепець або кишкивник. У випадку защемлення кишкивника, якщо
                защемлення триває довго (більше 6 годин) виникає омертвіння
                стінки його (некроз) і кишковий вміст виливається в черевну
                порожнину . Виникає її запалення - перетоні. Це дуже небезпечне
                ускладнення яке досить часто приводить до фатального кінця даже
                при його лікуванні. Зашемлені діафрагмальні грижі виникають
                рідко і їх діагностика чиризвичайно важка. Симтоми болю і
                напрохідності такіж як і при зичайні грижі, однак невидно
                випинання.
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>
              <h5>Гостра кишкова непрохідність</h5>
              <p>
                Форми кишкової непрохідності є різні, але клінічна картина їх
                практично однотипна. Захворювання починається з відсутності
                стула та відходження газів. Згодом з'являється роздутість живота
                і біль в животі. Однак непрохідність "механічна", яка виникає
                при спайкових процесів в черевні порожнині, защемлення
                кишкивника в грижовомі мішку та інвагінації, захворювання
                починається з болю. Згодом приєднується нудота і блювота. Є
                такий вислів "чим більше хворий з механічною кишковою
                непрохідністю живе до операції, тим менше він жеве після
                операції". Хворий має бути доправлений в медичний заклад.
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>
              <h5>
                Перфоративна виразка шлунку чи ДПК або інши порожнистих органів
                черевної порожнини.
              </h5>
              <p>
                Дуже різький біль в животі з реакцією м'язів живота (вони стають
                як дошка напружені), повинні дуже насторожити хворого і
                оточуючих хворого людей, щод невідкладно переправити його до
                лікувального закладу. В перші хвилини при перфоративні виразці
                хворий неможе дихнути, настільки виражена реакція на подразненя
                очеревини вмістом шлунка і ДПК(враховуючи їх кислотність).
                Практично "обпалює" очеревину. Згодом більдещо вшухає, однак
                стан хворого дедалі погіршується із за розвитку переоніта
                (запалення очеревини). При відсутності мидичної допомого, досить
                швидко настає фатальний результат.
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>
              <h5>Гострі гнійно-некротичні захворювання</h5>
              <p>
                Флегмони різних локалізацій та росповсюдження також можуть
                привести до досить серйозних наслідків для зоров'я хворого та
                його життя. Тому при винекнення такого захворювання треба також
                негайно звертатися до лікаря. Клінічна картина це припухлість та
                почервоніння і біль в ділянці ураження, підвищення температури
                тіла і порушення функції.
              </p>
              <p>
                <strong>Треба негайно звернутися до лікаря.</strong>
              </p>{' '}
            </div>

            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/urgentno/apendezit.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/urgentno/cholez.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/urgentno/pancreat.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/urgentno/peritonit.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/urgentno/gemo.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/urgentno/gernio1.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/urgentno/ilius.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/urgentno/ulzer.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/urgentno/flegmona.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={600}
                height={600}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      <div>
        <h2 className={styles.firstSurgeryName}>Пластична хірургія</h2>
      </div>

      {/* розділ Абдомынопластика */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('abdominoplasty')}>
          Абдомінопластика <span>{isAbdominoplasty ? '▲' : '▼'}</span>
        </h3>
        {isAbdominoplasty && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h5>Абдомінопластика </h5>
              <p>
                Пластика живота (абдомінопластика) – затребувана пластична
                операція, яка дозволяє отримати ідеально рівний животик і гарну
                талію після пологів та різкого схуднення. Це стає можливим за
                рахунок позбавлення від надлишків шкіри та підшкірного жиру (так
                званий «фартух») і додання тонусу передній черевній стінці.
                Абдомінопластика повертає фігурі стрункість і пропорційність,
                гармонійні контури.
              </p>

              <h4>Види абдомінопластики</h4>
              <h5>Класична абдомінопластика.</h5>
              <p>
                Вона застосовується для усунення шкірно-жирового «фартуха», що
                зайво провисає внизу живота, якому найчастіше супроводжують
                діастаз і грижа. Розріз робиться над пахвинною областю
                (горизонтально) та навколо пупка. Пластичний хірург видаляє
                надлишок шкірного покриву і жирової тканини, вшиває м’язи, що
                розійшлися, і формує нове пупкове кільце. Методика дозволяє
                працювати з великими обсягами фартуха. З її допомогою
                відновлюються властивості м’язового корсета, формується нова
                лінія талії та реконструюються контури тіла.
              </p>

              <h5>Абдомінопластика із вертикальним розрізом.</h5>
              <p>
                Метод відрізняється від попереднього розташування розрізу. Його
                роблять вертикально – по середній лінії живота, а не над
                лобковою областю. Надлишок тканини усувається від боків до
                середини. Розріз розташовуватиметься вертикально. Перевага
                такого хірургічного втручання у меншій травматичності, оскільки
                спеціаліст працює з невеликою зоною.
              </p>

              <h5>Мініабдомінопластика</h5>
              <p>
                Малоінвазивне втручання, показане пацієнтам, які хочуть
                підкоригувати зовнішній вигляд тіла – надати естетичної форми
                нижньому відділу черевної порожнини. Хірург робить розріз у
                ділянці бікіні, відсікає частину шкіри та жирової тканини. Ця
                методика не передбачає перенесення пупка та зміни його форми, а
                також ушивання розтягнутих м’язів.
              </p>

              <h5>Абдомінопластика сполучена з ліпосакцією.</h5>
              <p>
                Для отримання більш вираженого ефекту в деяких випадках пластика
                живота поєднується з ліпосакцією. Перевага полягає в тому, що
                разом із надлишком шкірно-жирового «фартуха» та зміцненням
                м’язів забирається надлишок жиру. Ліпосакцію проводять на
                фланках (боках) через невеликі проколи
              </p>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/abdominoplasty/abdomino4.jpg"
                // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/abdominoplasty/surger.jpeg"
                // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/abdominoplasty/result22.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/abdominoplasty/result.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/abdominoplasty/abdomin.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>
      {/* розділ мамопластика*/}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('augmentation')}>
          Аугметаційна мамопластика - Збільшення грудей
          <span>{isAugmentation ? '▲' : '▼'}</span>
        </h3>
        {isAugmentation && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h4>
                <i>Збільшення грудей за допомогою імплантів</i>
              </h4>
              <p>
                Імплантація молочних залоз вважається найбільш популярною
                операцією в області пластичної хірургії. За допомогою
                силіконових імплантів збільшують розмір або коректують форму
                грудей
              </p>
              <p>
                <strong>Операція по збільшенню грудей,</strong> підходить
                жінкам, які мають помітні вікові зміни молочних залоз, або ж
                володіють маленьким або великим об’ємом грудей. <br />
                <u>Ендопротизування </u>також рекомендована жінкам з вродженим
                недорозвиненням грудей, а також в тих випадках, коли молочні
                залози зазнали змін в результаті великої втрати ваги.
                <br />{' '}
                <u>
                  Повернути красиву форму грудей можливо після пологів та
                  грудного вигодовування.
                </u>
              </p>

              <h4>
                <strong>
                  Покази до операції збільшувальної пластики молочної залози
                </strong>
              </h4>
              <ul>
                <li>незадоволеності об’ємом і формою бюста;</li>

                <li>
                  Значне погіршення форми грудей у період після пологів та
                  лактації, при різкому зниженні ваги, при травмах.
                </li>
                <li>
                  тубулярний бюст — характеризується нетиповою формою, що
                  нагадує тубу
                </li>
                <li>
                  асиметрія молочних залоз — це стан, коли одна з молочних залоз
                  значно більша або менша за іншу;
                </li>
                <li>
                  гіпоплазія молочної залози (маленькі груди) - недостатній
                  розвиток бюста, що не відповідає загальним тілесним
                  пропорціям;
                </li>
                <li>
                  синдром Полланда — генетичне захворювання, що призводить до
                  недорозвинення м'язів і кісток, включаючи молочні залози;
                </li>
                <li>
                  післялактаціонна інволюція молочних залоз – атрофія, що
                  відбувається після періоду годування немовля;
                </li>
                <li>Опущення грудей, що стається з віком.</li>
                <li>Втягнення, асиметричне збільшення сосків.</li>
                <li>Патологічні інволютивні зміни.</li>
                <li>Мастектомія.</li>
              </ul>

              <h4>Протипоказами до проведення цієї операції є:</h4>
              <ul>
                <li>Захворювання крові.</li>
                <li>Вік менше вісімнадцяти років.</li>
                <li>Поточна вагітність.</li>
                <li>Проблеми зі згортанням крові – гемофілія.</li>
                <li>Неконтрольований цукровий діабет.</li>
                <li>Загострення хронічних захворювань та їх декомпенсація.</li>
                <li>Гострі вірусні та бактеріальні інфекції.</li>
                <li>Гнійничкові захворювання шкіри.</li>
                <li>Невиліковні онкологічні захворювання.</li>
                <li>Психічні розлади.</li>
              </ul>

              <h4>Види збільшувальної мамопластики</h4>
              <p>
                {' '}
                <i>В залежності від місця встановки імпланта мамопластика є:</i>
              </p>
              <ul>
                <li>під молочною залозою - субгляндулярно </li>
                <li>під грудним м'язом - субпекторально</li>
              </ul>

              <p>
                <i>
                  В залежності від виконання розрізу для постановки імпліна є:
                </i>
              </p>
              <ul>
                <li>Параареолярний (на границі ареоли).</li>
              </ul>

              <p>
                Доступ до грудей через ареоли сосків, при цьому косметичний
                післяопераційний рубець залишається практично непомітним, часто
                такий метод застосовується в поєднанні з круговою підтяжкою
                грудей.
              </p>

              <ul>
                <li>Субмаммарний (під груддю).</li>
              </ul>

              <p>
                Найбезпечніший метод, доступ до тканин здійснюється через розріз
                під грудьми в природній складці.
              </p>
              <ul>
                <li>Аксілярний (пахвовий)</li>
              </ul>

              <p>
                Доступ до грудей здійснюється через надріз у пахвових западинах,
                тканини молочних залоз за такого методу операції не зачіпаються.
              </p>

              <h4>Ми використовуємо імпланти</h4>
              <p>
                Ми в свої практиці використовуємо уже на протязі 23 років
                імпланти однієї фірми. Високоякісні оболонки імплантатів
                виготовлені із силіконового еластомеру., матеріалу з високими
                експлуатаційними характеристиками, особливо стійкого до хімічних
                та механічних впливів. Оболонка, що складається з декількох
                шарів, має чітко визначену структуру та спеціальний бар'єрний
                шар, призначений для запобігання міграції силіконових олій.
                Імпланти є декількох видів: в залежності від поверхності
                оболонки є: з гладкою оболонкою, з мікротекстурованою шорсткою
                поверхнею, покриті шаром мікрополіуретанової піни. По формі
                круглі, каплеподібні на круглі основі , а також анатомічні з
                короткою та довгою основою.
              </p>
              <h4>Термін придатності імплантів</h4>
              <p>
                Сучасні виробники силіконових ендопротезів говорять про
                необмежений термін придатності таких виробів. Навіть при
                тривалому використанні вони не провокують появу будь-яких
                новоутворень і не впливають на процес грудного годування. Однак
                з плином часу жіночі груди можуть змінити свою природну форму,
                що потребує проведення повторної операції для надання їй
                естетичного зовнішнього вигляду.
              </p>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/augmentation/1mammoplasty.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/augmentation/removalInfo30.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/augmentation/augmentation12.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/augmentation/augmentation11.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/augmentation/augmentation14.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/augmentation/augmentation5.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/augmentation/augmentation3.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/augmentation/removalInfo32.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/augmentation/removalInfo23.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* Заміна або видалення імплантів молочних залоз */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('removalImplants')}>
          Заміна або видалення імплантів молочних залоз
          <span>{isRemovalImplants ? '▲' : '▼'}</span>
        </h3>
        {isRemovalImplants && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h4>
                <i>Причини видалення або заміни імплантів молочної залози</i>
              </h4>

              <h4>З естетичних міркувань пацієнта.</h4>
              <ul>
                <li>- бажання збільшити або зменшити наявний об’єм грудей.</li>
                <li>
                  - Зміни форми грудей, викликані вагітністю, годуванням,
                  змінами маси тіла, обвисанням.
                </li>
                <li>
                  - Oпущення імплантів після маммопластики (птоз) внаслідок
                  вікових змін;
                </li>
                <li>- заміна на більш сучасну модель;</li>
                <li>- асиметрія грудей після маммопластики;</li>
                <li>
                  - не влаштовує форма грудей у результаті неправильно
                  підібраних імплантів;
                </li>
                <li>- видно чіткі обриси імплантів;</li>
              </ul>

              <h4>По медичним показам</h4>
              <ul>
                <li>- Розвиток сероми.</li>
                <li>- Фіброзно-капсулярна контрактура</li>

                <li>- Розрив імпланта внаслідок ДТП або травми.</li>
                <li>- інфекції, запалення прилеглих тканин.</li>
                <li>- Реакція організму на матеріал імплантів.</li>
              </ul>

              <h4>Протипоказами до проведення планової операції є:</h4>
              <ul>
                <li>- Захворювання крові.</li>

                <li>- Поточна вагітність.</li>
                <li>
                  - Проблеми зі згортанням крові – гемофілія.(операція
                  виконується під прикриттям необхідних антигемофільних
                  припаратів.).
                </li>
                <li>
                  - Неконтрольований цукровий діабет. (операція виконується
                  після стабілізації цукру під наглядом ендокринолога).
                </li>
                <li>
                  - Загострення хронічних захворювань та їх декомпенсація.
                  Операція проводиться після лікування захворюваннь, встадії
                  компенсації.
                </li>
                <li>- Гострі вірусні та бактеріальні інфекції.</li>
                <li>- Гнійничкові захворювання шкіри.</li>
                <li>- Психічні розлади.</li>
                <li>- Будь які гострі захворювання.</li>
              </ul>
              <h4>
                Протипоказами до проведення ургентного оперативного лікуванн - :
              </h4>
              <p>
                Дуже важкий загальний стан хворого не пов'язаний з імплантами.
              </p>
              <h4>До ургентних операцій віносяться.</h4>
              <ul>
                <li>- Розрив імпланта (умовно ургентна).</li>
                <li>
                  - Нагноєння навколо імпланта або мастит який прорвався в
                  ділянку імплінта.
                  <i>
                    (при дуже важкому стані пацієнта і доведенні про нагноєння
                    виконується мінімальне оперативне втручання для дренування
                    гнійної порожнини з її санацією).
                  </i>
                </li>
              </ul>

              <h4>
                <strong>Методи проведення операції:</strong>
              </h4>
              <p>
                Операція триває 2 - 2.5 години, в залежності від необхідного
                обсягу робіт.
              </p>
              <p>
                Розріз робиться за старим рубцю і через нього відбувається
                вилучення самого протеза і навколишнього його фіброзної тканини
                (капсули). Якщо операція здійснюється в комплексі з підтяжкою,
                то можуть знадобитися інші надрізи тканин.
              </p>
              <p>
                У більшості жінок капсула являє собою найтоншу мембрану зі
                сполучної тканини, що вистилає периметр навколо імплантату. При
                капсулярній контрактурі, вона схожа на мішок з товщиною стінок
                від 0,5 мм до 1 см. При цьому мішок скорочується, деформуючи тим
                самим імплант і груди.
              </p>

              <h4>
                <strong>Методи видалення імплантів:</strong>
              </h4>
              <ul>
                <li>Одномоментно з капсульним мішком енблок “en bloc”</li>
                <li>
                  Без капсули (коли самої капсули і капсулярної контрактури
                  немає, така ситуація у більшості пацієнток).
                </li>
                <li>З фрагментами капсули.</li>
              </ul>
              <h5>Імпланти поліуретановим покриттям. </h5>
              <p>
                <i>Якщо заміна імплантів меньше чим 7 днів </i>після установки,
                то можна виділити їх без навколишніх тканин.{' '}
                <i>Якщо пізніще,</i> то вже пройшла інтеграція поліуританового
                покриття із тканинами і імплант виділити можна
                <i> з капсулою - “en bloc”.</i>
              </p>

              <h4>
                <strong>Заміна імплантів.</strong>
              </h4>
              <p>
                Операція з вилучення старих імплантів та встановлення на їх
                місце нових має назву - реендопротезування.
              </p>
              <p>
                <u>
                  Одномоментно видалити старі імпланти і встановити нові можна в
                  тому випадку, якщо операція проводитися не через запалення або
                  інфекції.
                </u>{' '}
                В іншому випадку рекомендовано дочекатися відновлення і провести
                повторну операцію.
              </p>
              <p>
                При потребі під час оперативного втручання можливо доведеться
                виконувати підтяжку грудей, що спричинить додаванню нових
                розрізів. Таку ситуацію також обговорюється при передопераційних
                консультаціячх.
              </p>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/RemovalImmp/removalInfo24.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/RemovalImmp/removalInfo15.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/RemovalImmp/removalInfo2.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/RemovalImmp/removalInfo11.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/RemovalImmp/removalInfo22.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/RemovalImmp/removalInfo29.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/RemovalImmp/removalInfo28.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/RemovalImmp/removalInfo25.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/RemovalImmp/removalInfo27.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />

              <img
                src="/images/RemovalImmp/removalInfo43.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/RemovalImmp/removalInfo9.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/RemovalImmp/removalInfo15.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ гінекомастія */}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('gynecomastia')}>
          Гінекомастія <span>{isGynecomastia ? '▲' : '▼'}</span>
        </h3>
        {isGynecomastia && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <p>
                Гінекомастія — захворювання, що проявляється збільшенням у
                розмірах грудних залоз від 1 до 10 см у чоловіків, внаслідок
                розростання жирової або залозистої клітковини.{' '}
              </p>
              <p>
                Захворювання виникає через переважання в чоловічому організмі
                жіночих статевих гормонів.{' '}
              </p>

              <h5>Гінекомастія справжня</h5>
              <p>
                залозиста тканина розростається, що говорить про патологічному
                процесі, який потрібно контролювати та лікувати. У такому разі
                необхідна консультація ендокринолога та мамолога.
              </p>
              <ul>
                <li>Фізіологічна - в підростковому періоді</li>
                <li>
                  патологічна - при порушеннях видалення гормонів (печінкова та
                  ниркова недостатність, пухлини наднирників і тд){' '}
                </li>
              </ul>

              <h5>несправжня</h5>
              <ul>
                <li>помилкова</li>
                <li>жирова</li>
              </ul>

              <p>
                грудний м'яз звисає і «розростається» за рахунок надлишку жиру.
                При схудненні та нормалізації харчування практично відразу
                надлишковий об'єм у грудях зникає
              </p>

              <h5>Змішана</h5>
              <p>
                є як процес розростання залізистої тканини, так і збільшення
                жирового прошарку. Такий тип гінекомастії характерний для
                чоловіків з ожирінням, порушеннями в гормональному обміні та
                харчуванні. Він вимагає комплексного тривалого лікування та
                корекції.
              </p>

              <h5>За характиром зміни тканин</h5>
              <ul>
                <li>Дифузна</li>
                <li>Вузлова</li>
              </ul>

              <h5>За розмірами:</h5>
              <ul>
                <li>
                  I ступінь — найменша субареолярна вузловатість. Розмір
                  збільшених грудей при цьому обмежується районом навколо ареоли{' '}
                </li>
                <li>
                  III ступінь — вузол має розмір ареоли. Сосково-ареолярний
                  комплекс при цьому розташовується вище за лінію субмамарної
                  складки. (до 6 см)
                </li>
                <li>
                  II ступінь — ущільнення менше розміру ареоли. На цьому етапі
                  відзначається розвиток значної гіпертрофії та птозу (опущення)
                  грудей (До 10 см)
                </li>
                <li>
                  IV ступінь — ущільнення більше, ніж пігментована ділянка
                  навколо сосків. На термінальному етапі розвитку гіпертрофія та
                  птоз стають найбільш вираженими.(Більше 10 см){' '}
                </li>
              </ul>

              <p>
                {' '}
                Кроме збільшення грудних залоз присутні такі симптоми як біль та
                ушільнення під соскової ділянки, збільшення ареол.{' '}
              </p>
              <p>
                Гінекомастія може бути початковим симптомом дуже важких і
                небезпечних для здоров'я пацієнта захворюванням, а також може
                перероджуватись в онкологію. Тому при виявленні в себе хоча б
                найманших ознаків такого захворювання слід проконсультуватися у
                лікаря.{' '}
              </p>

              <p>
                Наша лікарня консультує і проводить лікування в разі виявлення
                такого недугу у хворого. У нас є досвдчений ендокринолог та
                КОМАНДА ПЛАСТИЧНИХ ХІРУРГІВ
              </p>
            </div>

            <div className={styles.firstSurgeryImage}>
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>

      {/* розділ ліпоскульптура*/}

      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('liposuction')}>
          Ліпоскульптура - ліпосакція. <span>{isLiposuction ? '▲' : '▼'}</span>
        </h3>
        {isLiposuction && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h3>Ліпоскульптурування</h3>
              <p>
                {' '}
                — це малотравматична операція, яка полягає в послідовному
                видаленні поверхневих і глибоких шарів жирової тканини і
                допомагає створити атлетичний мишечний рельєф в області життя,
                талії, ягодиць, ніг і т. д.{' '}
              </p>
              <p>
                {' '}
                У медичній літературі можна зустріти інші назви ліпоскульптури —
                «High-Definition Liposculpture» (HDL), «спортивна ліпосакція»,
                «HD-ліпосакція», «3D-ліпоскульптурування».
              </p>

              <h5>Ліпоскульптурування живота </h5>
              <p>
                {' '}
                одна з найпопулярніших зон для ліпоскульптурування. Видалення
                жиру з цієї зони допомагає створити більш плоский і тонкий
                вигляд живота, сформувати кубики преса.
              </p>

              <h5>Ліпоскульптурування боків і талії</h5>
              <p>
                дає змогу сформувати більш чітку лінію талії, що візуально
                покращує пропорції тіла і створює бажану “пісочний годинник”
                фігуру.
              </p>

              <h5>Ліпоскульптурування стегон</h5>
              <p>
                може зменшити “вушка” та інші жирові відкладення, створюючи
                більш гладкий і збалансований силует.
              </p>

              <h5>Ліпомоделювання сідниць </h5>
              <p>
                використовується для збільшення або формування більш округлих і
                підтягнутих сідниць. Жир, отриманий з інших ділянок тіла, може
                бути доданий для збільшення об’єму і поліпшення форми сідниць
              </p>

              <h5>Ліпомоделювання грудних м’язів </h5>
              <p>
                ліпоскульптурування чоловіків допоможе підкреслити рельєф
                грудних м’язів, створюючи більш виражений і атлетичний вигляд.
              </p>

              <h5>Ліпомоделювання внутрішньої частини стегон </h5>
              <p>
                зона часто коригується для усунення тертя і для створення більш
                чіткої розмежованої лінії між стегнами.
              </p>

              <h5>Ліпоскульптурування колін </h5>
              <p>
                жир у ділянці колін може бути прибраний для більш чіткої та
                визначеної форми ніг.
              </p>

              <h5>Ліпоскульптурування щиколоток та литок</h5>
              <p>
                допомагає зменшити “жирові подушки” і сформувати стрункішу
                атлетичну лінію ніг.
              </p>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/Mykola.jpg" // Шлях до зображення з папки public
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>
      {/* розділ карпальний синдром */}
      <div className={styles.firstSurgerySection}>
        <h3 onClick={() => toggleSection('carpalSyndrome')}>
          Синдром карпального каналу <span>{isCarpalSyndrome ? '▲' : '▼'}</span>
        </h3>
        {isCarpalSyndrome && (
          <div className={styles.firstSurgeryTitle}>
            <div className={styles.firstSurgeryText}>
              <h2>Тунельний карпальний синдром</h2>
              <p>
                <br />
                попри його багато назв ({' '}
                <em>
                  cиндро́м зап'я́стного кана́лу, “синдром друкарки”, хвороба
                  офісних працівників…
                </em>
                )є там захворюванням яке виникає в людей, чия професія пов'язана
                з одноманітними рухами зап'ястя та незручним положенням рук при
                виконанні роботи
              </p>
              <p className={styles.indentedText}>
                Суть захворювання зводиться до того,що в процесі цих рухів кисті
                поступово виникає{' '}
                <u>потовщення і ушільненя оболонок сухожилків згиначів,</u> які
                проходять з передпліччя на кисть через вузький кнал на запястку.
                Цей канал називається карпальним, є досить обмежений і в зв'язку
                з тим що він утворений з трьох сторін кістками зап'ястка. А з
                однієї сторони досить щільною карпальною з'язкою, яка невзмозі
                розтягуватися. Тому місця в цьому каналі досить обмежено і через
                ці потовшення оболонок сухожилок приводить{' '}
                <u>до стискання нера (серединного) </u>який також там проходить.
              </p>
              <h4>Серединний нерв дозволяє:</h4> <br />
              <ul>
                <li> відчувати перші чотири пальці, </li>
                <li>
                  відповідає за координацію руху кисті, дрібну моторику рук,
                </li>
                <li>
                  звуження і розширення кровоносних судин від дії зовнішніх
                  подразників
                </li>
                <li>регулює роботу потових залоз долоні</li>
              </ul>
              <div className={styles.developList}>
                <h4>Все починається з </h4>
                <p>
                  Першою зазвичай захворює провідна рука (рука яка більше бере
                  на себе навантаження )
                </p>
                <ul>
                  <li>
                    прогресуючого оніміння і болю у руках, особливо вночі;
                  </li>
                  <li>виникає набряклость, нечутливості пальців вранці;</li>
                </ul>
                <h4>Прогресування</h4>
                <p>
                  Якщо захворювання не ліковане то згодом до них додаються такі
                  сиптоми як:
                </p>
                <ul>
                  <li>порушення рухів долонь, слабкість рук;</li>
                  <li>нездатність брати та утримувати дрібні предмети.</li>
                </ul>
                <h4>В фінальні стадії зхворювання</h4>
                <p>
                  Якщо довго не лікувати затискання нерва, це може призвести до
                  незворотнього пошкодження нерва та радикально погіршити якість
                  життя
                </p>
                <ul>
                  <li>
                    порушення чутливості пальців стають дедалі більше вираженими
                  </li>
                  <li>з часом зношуються м’язи долоні</li>
                  <li>
                    долоня втрачає свою силу і зникає здатність виконувати
                    навіть прості повсякденні дії.
                  </li>
                </ul>
                <p>
                  Наведена вище картина приводить до того, що хворий звертається
                  до лікаря.
                </p>
              </div>
              <h2 className={styles.conservTitle}>
                Консервативне лікування синдрому карпального каналу
              </h2>
              <h4>Консервативне лікування в невропатолога</h4>
              <p>
                Застосування консервативної терапії чаще є початковим методом
                лікування. Як правело хворий спочатку захворювання потрапляє до
                невропатолога, який починає лікування з неї.Консервативне
                лікування синдрому зап'ястного каналу спрямоване на те, щоб
                зменшити травматизацію серединного нерва в каналі (зменшення
                набряку оболонок сухожилок і зв'язок) , а також покращення
                обмінних процесів в самому нерві.
              </p>
              <h2>Напрямки консервативного лікування</h2>
              <ul>
                <li>
                  Це зміна (при можливості ) професії та модифікація способу
                  життя, дотримання режиму праці та відпочинку
                </li>
                <li>
                  Це носіння ортеза що понукає положення зап'ястка в
                  фізіологічному положенні і тим самим сприяє зменшеню тиску на
                  серединний нерв
                </li>
                <li>
                  Загальна лікарська терапія (НПЗП, засоби для поліпшення
                  кровообігу, зняття набряклості ); і фізіотерапія (масаж,
                  електрофорез); також дещо покращує стан хворого
                </li>
                <li>
                  Лікарські блокади щляхом введення анестетиків і
                  кортикостероїдів (кеналог, дипроспан) в зону тунелю для
                  купування болю і відновлення рухливості суглобів дає яскравий
                  і виражений, але нетривалий ефект
                </li>
              </ul>
              <h4>
                При неефективності консервативного лікування потрібне оперативне
                лікувавння
              </h4>
              <h2>Операція - найефективний спосіб</h2>
              <p>
                Це найбільш ефективний та останній спосіб лікування синдрому
                карпального каналу. Оскільки сутністю цієї хвороби є затискання
                нерва, мета операції – це звільнення нерва від затиснутого
                стану, що досягається шляхом перерізання карпальної зв’язки.
                Операція виконується в сучасні операційні з моніторним наглядом
                за станом пацієнта. триває недовго і легко переноситься., її
                роблять під місцевим (локальним) наркозом – як у стоматолога.
                Незабаром після операції пацієнт може вирушати додому.
              </p>
              <h4>Знебллення - місцеве.</h4>
              <p>
                В ділянку операції вводиться місцевий анастетик (після
                відповідних проб). При необхідності спосіб знеболення може
                коригуватися анастезіологом
              </p>
              <h4>Методи оперативного лікування</h4>
              <p>
                {' '}
                Для звільнення нерва застосовується або традиційний хірургічний
                метод, або більш новий і значно менш травматичний ендоскопічний
                метод.
              </p>
              <h5>Традиційний метод</h5>
              <p>
                В ділянці запястка, по нижній складці робиться косий розріз 1,5
                - 2,0 см через який знаходится карпальна з'язка і розсікається в
                поперечному до неї напрямку. Після контролю зупинки кровотечі
                шви накладаються тільки на шкіру. Через деякий час розрізу
                практично невидно
              </p>
              <h5>Ендоскопічний метод</h5>
              <p>
                Ендоскопічний метод є набагато щаднішим для пацієнта. Через
                маленький розріз в шкірі в карпальний канал вводиться
                мініатюрний ендоскоп (медична відеокамера) і з застосуванням
                маленьких хірургічних інструментів перерізається карпальна
                зв’язка, звільняючи таким чином нерв.
              </p>
            </div>
            <div className={styles.firstSurgeryImage}>
              <img
                src="/images/CarpalSyndrome/carp39.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp56.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp25.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp18.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp15.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp58.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp52.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp16.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp10.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp7.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp41.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
              <img
                src="/images/CarpalSyndrome/carp42.jpg"
                alt="Doctor"
                width={200}
                height={200}
                // className={styles.tunnelImage}
              />
            </div>
          </div>
        )}
      </div>
    </div>
  )
}
